package com.tms.task7;

/**
 * 7*(Можно не делать!))Найти количество слов, содержащих только символы латинского алфавита. Пример:
 * "Методы доступа называют ещё аксессорами (от англ. access — доступ), или по отдельности — геттерами (англ. get — чтение) and сеттерами (англ. set — запись)"
 */
public class MainTask7 {
    String string = "Методы доступа называют ещё аксессорами (от англ. access — доступ), или по отдельности — геттерами (англ. get — чтение) and сеттерами (англ. set — запись)";

}
